using NpgsqlTypes;

namespace Courseopt.Enums;

public enum ProductCategory
{
    [PgName("Крупы")]
    Крупы,

    [PgName("Макаронные изделия")]
    Макаронные_изделия,

    [PgName("Мука_Сахар_Соль")]
    Мука_Сахар_Соль,

    [PgName("Снэки")]
    Снэки,

    [PgName("Безалкогольные_напитки")]
    Безалкогольные_напитки,

    [PgName("Вода")]
    Вода,

    [PgName("Растительные_масла")]
    Растительные_масла,

    [PgName("Сладости")]
    Сладости,

    [PgName("Консервы")]
    Консервы,

    [PgName("Другое")]
    Другое
}
